Examinator/src/Enums/ТипыУчебныхМатериаловСУО/ТипыУчебныхМатериаловСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчебныхМатериаловСУО</name>
  <enumValues>
    <name>ЗаданиеНаПроверку</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйУчебник</name>
  </enumValues>
  <enumValues>
    <name>СлайдовыйКурс</name>
  </enumValues>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыУчебныхМатериаловСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Функция СписокВыбора() Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.ЗаданиеНаПроверку);
	ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник);	
	
	Если ЭлектронноеОбучение.ИспользоватьЭлектронноеОбучение() Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.СлайдовыйКурс);				
	КонецЕсли;	
	
	Если НЕ ЭлектронноеОбучение.ИспользоватьЭлектронноеОбучение() Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУчебныхМатериаловСУО.Тест);
	КонецЕсли;		
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
